Autodesk.Revit.DB.Analysis.gbXMLOpeningType
This enumeration corresponds to the openingType attribute in gbXML
and identifies the type of opening defined.
Since:
2012

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.NoOfOpeningTypes
No of opening types.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.OpeningAir
Opening air.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.NonSlidingDoor
Non sliding door.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.SlidingDoor
Sliding door.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.OperableSkylight
Operable skylight.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.FixedSkylight
Fixed skylight.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.OperableWindow
Operable window.

Autodesk.Revit.DB.Analysis.gbXMLOpeningType.FixedWindow
Fixed window.